//Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

Console.WriteLine("Введите трехзначное число:");
string x = Convert.ToString(Console.ReadLine());
Console.WriteLine(x[1]);
